In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\anisa\anaconda3\lib\site-packages (8.0.28)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\anisa\anaconda3\lib\site-packages (from mysql-connector-python) (3.17.3)
Requirement already satisfied: six>=1.9 in c:\users\anisa\anaconda3\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)

In [2]:
import mysql.connector as conn

In [3]:
conn.connect(host = 'localhost',user = 'root' ,passwd = "black97tiger19")

In [4]:
mydb = conn.connect(host = 'localhost',user = 'root' ,passwd = "black97tiger19")

In [9]:
cursor = mydb.cursor()

In [5]:
import pandas as pd

In [6]:
pd.read_sql("select * from SqlAssignment.worker",mydb)

    emplyeeid firstname  lastname         department  salary date_of_joining
0      208856   Anirudh     sarma                 IT   35000            None
1        9369      TONY     STARK  SOFTWARE ENGINEER    7902      1980-12-17
2        9499       TIM     ADOLF           SALESMAN    7698      1981-02-20
3        9566       KIM    JARVIS            MANAGER    7839      1981-04-02
4        9654       SAM     MILES           SALESMAN    7698      1981-09-28
5        9782     KEVIN      HILL            MANAGER    7839      1981-06-09
6        9788    CONNIE     SMITH            ANALYST    7566      1982-12-09
7        9839    ALFRED   KINSLEY          PRESIDENT    7566      1981-11-17
8        9844      PAUL   TIMOTHY           SALESMAN    7698      1981-09-08
9        9876      JOHN    ASGHAR  SOFTWARE ENGINEER    7788      1983-01-12
10       9900      ROSE   SUMMERS     TECHNICAL LEAD    7698      1981-12-03
11       9902    ANDREW  FAULKNER           ANAYLYST    7566      1981-12-03
12       9934     KAREN  MATTHEWS  SOFTWARE ENGINEER    7782      1982-01-23
13       9591     WENDY     SHAWN           SALESMAN    7698      1981-02-22
14       9698     BELLA      SWAN            MANAGER    7839      1981-05-01
15       9777     MADII   HIMBURY            ANALYST    7839      1981-05-01
16       9860    ATHENA    WILSON            ANALYST    7839      1992-06-21
17       9861  JENNIFER    HUETTE            ANALYST    7839      1996-07-01
18       9861  JENNIFER    HUETTE            ANALYST    7839      1996-07-01
19       9861  JENNIFER    HUETTE            ANALYST    7839      1996-07-01
20       9861  JENNIFER    HUETTE            ANALYST    7839      1996-07-01

In [14]:
#1
cursor.execute("select firstname as worker_name from sqlassignment.worker ")

In [15]:
cursor.fetchall()

[('Anirudh',),
 ('TONY',),
 ('TIM',),
 ('KIM',),
 ('SAM',),
 ('KEVIN',),
 ('CONNIE',),
 ('ALFRED',),
 ('PAUL',),
 ('JOHN',),
 ('ROSE',),
 ('ANDREW',),
 ('KAREN',),
 ('WENDY',),
 ('BELLA',),
 ('MADII',),
 ('ATHENA',),
 ('JENNIFER',),
 ('JENNIFER',),
 ('JENNIFER',),
 ('JENNIFER',)]

In [16]:
#2
cursor.execute("select distinct department from sqlassignment.worker ")

In [17]:
cursor.fetchall()

[('IT',),
 ('SOFTWARE ENGINEER',),
 ('SALESMAN',),
 ('MANAGER',),
 ('ANALYST',),
 ('PRESIDENT',),
 ('TECHNICAL LEAD',),
 ('ANAYLYST',)]

In [22]:
#3
cursor.execute("select * from sqlassignment.worker order by emplyeeid desc limit 5 ")

In [23]:
cursor.fetchall()

[(208856, 'Anirudh', 'sarma', 'IT', 35000, None),
 (9934,
  'KAREN',
  'MATTHEWS',
  'SOFTWARE ENGINEER',
  7782,
  datetime.date(1982, 1, 23)),
 (9902, 'ANDREW', 'FAULKNER', 'ANAYLYST', 7566, datetime.date(1981, 12, 3)),
 (9900, 'ROSE', 'SUMMERS', 'TECHNICAL LEAD', 7698, datetime.date(1981, 12, 3)),
 (9876,
  'JOHN',
  'ASGHAR',
  'SOFTWARE ENGINEER',
  7788,
  datetime.date(1983, 1, 12))]